PANDA

In [30]:
import numpy as np
import pandas as pd

In [31]:
A=[[1,2,3,4,5,31,7,8,'A','B'],[2,4,3,45,6,6,7,8,9]]

In [32]:
df0=pd.DataFrame(A) # List into dataframe

In [33]:
df0

   0  1  2   3  4   5  6  7  8     9
0  1  2  3   4  5  31  7  8  A     B
1  2  4  3  45  6   6  7  8  9  None

In [34]:
B={'X':['Abhishek'],'Y':['Dhiman']}

In [55]:
df=pd.DataFrame(B)
df# Dictionary into dataframe

          X       Y
0  Abhishek  Dhiman

In [36]:
C=[1,2,3,4,5,6,7,8,9,10]

In [37]:
C

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [38]:
df2=pd.DataFrame(C)
df2

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [39]:
df0.head(1)

   0  1  2  3  4   5  6  7  8  9
0  1  2  3  4  5  31  7  8  A  B

In [40]:
df0.tail(1)

   0  1  2   3  4  5  6  7  8     9
1  2  4  3  45  6  6  7  8  9  None

In [41]:
df2.shape

(10, 1)

In [42]:
df0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 10 columns):
0    2 non-null int64
1    2 non-null int64
2    2 non-null int64
3    2 non-null int64
4    2 non-null int64
5    2 non-null int64
6    2 non-null int64
7    2 non-null int64
8    2 non-null object
9    1 non-null object
dtypes: int64(8), object(2)
memory usage: 240.0+ bytes

In [43]:
df0.describe()

              0         1    2          3         4         5    6    7
count  2.000000  2.000000  2.0   2.000000  2.000000   2.00000  2.0  2.0
mean   1.500000  3.000000  3.0  24.500000  5.500000  18.50000  7.0  8.0
std    0.707107  1.414214  0.0  28.991378  0.707107  17.67767  0.0  0.0
min    1.000000  2.000000  3.0   4.000000  5.000000   6.00000  7.0  8.0
25%    1.250000  2.500000  3.0  14.250000  5.250000  12.25000  7.0  8.0
50%    1.500000  3.000000  3.0  24.500000  5.500000  18.50000  7.0  8.0
75%    1.750000  3.500000  3.0  34.750000  5.750000  24.75000  7.0  8.0
max    2.000000  4.000000  3.0  45.000000  6.000000  31.00000  7.0  8.0

In [44]:
df0

   0  1  2   3  4   5  6  7  8     9
0  1  2  3   4  5  31  7  8  A     B
1  2  4  3  45  6   6  7  8  9  None

In [45]:
df0.std() ## indvidually finding out values

0     0.707107
1     1.414214
2     0.000000
3    28.991378
4     0.707107
5    17.677670
6     0.000000
7     0.000000
dtype: float64

In [46]:
df0

   0  1  2   3  4   5  6  7  8     9
0  1  2  3   4  5  31  7  8  A     B
1  2  4  3  45  6   6  7  8  9  None

In [58]:
df0.sort_values(5,ascending=True)

   0  1  2   3  4   5  6  7  8     9
1  2  4  3  45  6   6  7  8  9  None
0  1  2  3   4  5  31  7  8  A     B

In [48]:
df0.isnull()

       0      1      2      3      4      5      6      7      8      9
0  False  False  False  False  False  False  False  False  False  False
1  False  False  False  False  False  False  False  False  False   True

In [49]:
df0.isnull().sum()

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
9    1
dtype: int64

In [50]:
df0

   0  1  2   3  4   5  6  7  8     9
0  1  2  3   4  5  31  7  8  A     B
1  2  4  3  45  6   6  7  8  9  None

In [60]:
df0.dropna(1)

   0  1  2   3  4   5  6  7  8
0  1  2  3   4  5  31  7  8  A
1  2  4  3  45  6   6  7  8  9

In [52]:
df0.fillna(7)

   0  1  2   3  4   5  6  7  8  9
0  1  2  3   4  5  31  7  8  A  B
1  2  4  3  45  6   6  7  8  9  7

In [53]:
df0.dropna(1)

   0  1  2   3  4   5  6  7  8
0  1  2  3   4  5  31  7  8  A
1  2  4  3  45  6   6  7  8  9

In [54]:
df0.append(df)

     0    1    2     3    4     5    6    7    8     9         X       Y
0  1.0  2.0  3.0   4.0  5.0  31.0  7.0  8.0    A     B       NaN     NaN
1  2.0  4.0  3.0  45.0  6.0   6.0  7.0  8.0    9  None       NaN     NaN
0  NaN  NaN  NaN   NaN  NaN   NaN  NaN  NaN  NaN   NaN  Abhishek  Dhiman